# Variables

* Son objetos que tienen un nombre y sirven para almacenar valores(datos) que serán utilizados en el programa
* Existen diversos tipos de variables, por ejemplo los básicos:
    * Números enteros: a = 1, b = 2 , parqueos = 4, sillas = 3
    * Números decimales(llamados float y/o double): pi = 3.1416 , edad = 24.5, velocidad = 25.5 , tipo_cambio = 7.40
    * Cadenas(llamados Strings): mi_nombre = “Luis Leal” ,curso = “Machine Learning”
    * Booleanos, contienen 2 únicos valores:
        * True
        * False

### Numeros enteros

In [18]:
total_alumnos = 5
sillas = 20
year = 2018
numero_curso = 1

### Numeros Decimales

In [19]:
pi = 3.1416
velocidad = 25.5
tipo_cambio = 7.40

### Strings

In [20]:
nombre_curso = 'Data science'
catedratico = 'Luis Leal'
auxiliar = 'Erick Diaz'
seccion_curso = 'A'

### Booleanos

In [21]:
curso_activo = True
sillas_disponibles = False

#### Obtener el tipo de una variable
Si queremos ver de que tipo es una variable utilizamos la funcion type( )

In [22]:
type(pi)

float

In [23]:
type(year)

int

In [24]:
type(nombre_curso)

str

# Listas y diccionarios

### Listas
* Permite guardar multiples objetos asociados bajo un mismo nombre.
* Similar al concepto de “Vector” que ya vimos, pero no restringido únicamente a números.
* Puede almacenar cualquier tipo de objeto básico(enteros, deci"males o strings) o bien otros objetos mas complejos(otras listas u otras estructuras de datos)

In [25]:
nombres_alumos = ['Marcos Amaya','Edwin Calderón','Boris Juárez','Isabel Miranda','Hanna Prera']
carnets_alumnos = [20200205, 20200394, 20200109, 20200263, 20200066]
carreras_alumnos = ['c1', 'c1', 'c2', 'c3', 'c3']
pagos = [100,200,300]

#### Obtener un elemento de la lista

In [26]:
pagos[2]

300

### Diccionarios
* Conocidos también como “hash tables” o “maps” o “hash maps”
* Permiten acceder de manera rápida a un valor que esta asociado a otro valor comunmente llamado “llave” ,es decir asocian una llave a un valor.
* Similar a un diccionario de idiomas o directorio teléfonico, permite asociar un valor(la llave) a otro(el valor), en un diccionario de idioma el “mapeo” es de una palabra(llave) a su significado(valor=, en el directorio teléfonico asocia o “mapea” un nombre de persona(llave) a su número de teléfono(valor)
* Para “consultar” o usar un valor dada una llave, se puede usar también corchetes, o la función get()

In [27]:
carreras = dict()
carreras['c1'] = 'Master en data sa' 
carreras['c2'] = 'Licenciatura en Administración de Empresas'
carreras['c3'] = 'Licenciatura en Ingeniería Empresarial'

In [28]:
carreras.get('c2')

'Licenciatura en Administración de Empresas'

In [29]:
curso = {'catedratico': catedratico, 'auxiliar' : auxiliar, 'nombre_curso' : nombre_curso, 'seccion': seccion_curso}

In [30]:
curso['nombre_curso']

'Data science'

# Operaciones aritmeticas
* Python permite realizar operaciones aritméticas a través de los simbolos de suma,resta ,multiplicación y división convencionales
* Ademas de las operaciones convencionales cuenta con operaciones para:
    * Exponenciación(\*\*): a\*\*b equivale a elevar “a” a la “b” potencia
    * División modular(%): a%b equivale a obtener el residuio de “a” dividido dentro de “b”
    * División entera(//): a//b equivale a obtener  la división de “a” dentro de “b” aproximda a el entero mas bajo.
* Asi también cuenta con operaciones para listas de números, por ejemplo:
    * sum(lista) : suma los valoes de una lista dada
    * max(lista) : obtiene el valor mayor de una lista dada
    * min(lista) : obtiene el valor menor de una lista dada
    * len(lista): devuelve el numero de elementos en una lista.

In [31]:
asientos_disponibles = sillas - total_alumnos
print(asientos_disponibles)

15

In [32]:
2**4

16

In [33]:
11%2

1

In [34]:
15//4

3

In [35]:
print('Lista de pagos: ', pagos)

total_pagos = sum(pagos)

print('Total = ', total_pagos)

print('Pago Mayor = ', max(pagos))

print('Pago Menor = ', min(pagos))

Lista de pagos:  [100, 200, 300]
Total =  600
Pago Mayor =  300
Pago Menor =  100

### Operaciones Logicas
* Operaciones que trabajan sobre objetos booleanos(True,False) y su resultado es también un booleano.
* Toda comparación da como resultado un valor booleano:
    * 1 > 2: False
    * 1 < 2: True
    * 3 != 2: True
    * 2 == 2: True
* Son exactamente iguales a lo visto en “tablas lógicas” en matemáticas
* Los 3 tipos mas usados son:
    * not: negación, convierte un valor True a False, y False a True
    * and: su resultado es verdadero si sus 2 operandos son verdaderos, en cualquier otro caso es falso
    * or : su resultado es falso si sus 2 operandos son falsos, en cualquier otro caso es verdadero

In [36]:
print(curso_activo)
print(not curso_activo)

True
False

### Condicionales
* Son operaciones que separan el flujo de ejecución del programa basados en una condición.
* Por ejemplo: ejecutar algo si se cumple que x> 0, si no se cumple ejecutar otra cosa.
* Python utiliza las sentencias: if, else, y elif para esto

In [37]:
max(pagos) > min(pagos)

True

In [38]:
max(pagos) < pagos[1]

False

In [39]:
if (curso_activo):
    print("El curso esta disponible")

El curso esta disponible

# Ciclos
* Permiten realizar una operación muchas veces.
* Por ejemplo, si tenemos una lista de usuarios y queremos imprimir el nombre de cada uno, utilizamos un ciclo y dentro del ciclo hacemos la impresion de nombre.
* Utilizados cuando queremos repetir la misma operacion muchas veces dependiendo de una condición.
* Repetiremos la operación mientras se cumpla una condición.
* La condición podría ser por ejemplo: mientras una lista no este vacía
* O bien podriamos repetir la operación una vez por cada elemento en una lista o secuencia de números.
* En Python contamos básicamente con:
    * for
    * While

In [40]:
for carnet in carnets_alumnos:
    print(carnet)

20200205
20200394
20200109
20200263
20200066

In [41]:
total_alumnos = len(nombres_alumos)
count = 0

while(count < total_alumnos):
    print(nombres_alumos[count])
    count+=1

Marcos Amaya
Edwin Calderón
Boris Juárez
Isabel Miranda
Hanna Prera

# Procedimientos y funciones
* Son grupos de sentencias de código que una vez definidas pueden ser “llamadas” por un nombre.
* Pueden o no recibir parametros.
* Un procedimiento es un grupo de sentencias  que realizan alguna tarea,pero no devuelven ningún resultado.
* Una función es un conjunto de sentencias que devuelve un resultado  a través de la sentencia “return, comunmente calculado dentro de la función”
* Tanto procedimientos como funciones son creados con la palabra “def”

In [42]:
def calcular_area(ancho,largo):
    area = ancho * largo
    return area

In [43]:
calcular_area(5,4)

20

In [44]:
def get_info_alumnos(nombres_alumos, carnets_alumnos, carreras_alumnos, carreras):
    for index, nombre in enumerate(nombres_alumos):
        carnet = carnets_alumnos[index]
        carrera = carreras.get(carreras_alumnos[index])
        print('>> Carnet: ', carnet, ' Nombre: ', nombre, ' Carrera: ', carrera)

In [45]:
def get_info_curso(curso, nombres_alumos, carnets_alumnos, carreras_alumnos, carreras):
    print(curso.get('nombre_curso'))
    print('Seccion:', curso.get('seccion'))
    print('Catedratico:', curso.get('catedratico'))
    print('Auxiliar:', curso.get('auxiliar'))
    print('')
    get_info_alumnos(nombres_alumos, carnets_alumnos, carreras_alumnos, carreras)

In [46]:
get_info_curso(curso, nombres_alumos, carnets_alumnos, carreras_alumnos, carreras)

Data science
Seccion: A
Catedratico: Luis Leal
Auxiliar: Erick Diaz

>> Carnet:  20200205  Nombre:  Marcos Amaya  Carrera:  Master en data sa
>> Carnet:  20200394  Nombre:  Edwin Calderón  Carrera:  Master en data sa
>> Carnet:  20200109  Nombre:  Boris Juárez  Carrera:  Licenciatura en Administración de Empresas
>> Carnet:  20200263  Nombre:  Isabel Miranda  Carrera:  Licenciatura en Ingeniería Empresarial
>> Carnet:  20200066  Nombre:  Hanna Prera  Carrera:  Licenciatura en Ingeniería Empresarial

# Librerias y paquetes
* Las librerías y paquetes son herramientas que extienden la funcionalidad default de un lenguaje de programación.
* Agregan funcionalidad específica para ciertas tareas que se puede reutilizar sin necesidad de programarlo desde 0
* Por ejemplo:
    * NumPy : librería para algebra lineal y computación numérica
    * Scikit-learn: machine learning
    * Matplotlib: graficas en Python
    * Time: librería de python para manejar relojes(por ejemplo contar cuanto tiempo tarda algo en ejecutarse)
* En Python antes de utilizar una librería debemos importarla , o bien importar un subconjunto de ella, utilizando “import”
    * Import numpy as np

In [47]:
import numpy as np

In [48]:
notas = np.array([70,80,75,60,90])

print(notas)

[70 80 75 60 90]

In [49]:
np.zeros( (3,4) )

array([[0., 0., 0., 0.],
       [0., 0., 0., 0.],
       [0., 0., 0., 0.]])

## Load CSV

In [52]:
import pandas as pd

In [53]:
data = pd.read_csv("data_titanic_proyecto.csv")

In [55]:
data.head()

,PassengerId,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,passenger_class,passenger_sex,passenger_survived
0,1,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S,Lower,M,N
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C,Upper,F,Y
2,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Lower,F,Y
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S,Upper,F,Y
4,5,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S,Lower,M,N

In [56]:
data

,PassengerId,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,passenger_class,passenger_sex,passenger_survived
0,1,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S,Lower,M,N
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C,Upper,F,Y
2,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Lower,F,Y
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S,Upper,F,Y
4,5,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S,Lower,M,N
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",27.0,0,0,211536,13.0000,NaN,S,Middle,M,N
887,888,"Graham, Miss. Margaret Edith",19.0,0,0,112053,30.0000,B42,S,Upper,F,Y
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 6607,23.4500,NaN,S,Lower,F,N
889,890,"Behr, Mr. Karl Howell",26.0,0,0,111369,30.0000,C148,C,Upper,M,Y
890,891,"Dooley, Mr. Patrick",32.0,0,0,370376,7.7500,NaN,Q,Lower,M,N

In [ ]:
late